app/controllers/charges_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "order_histories" ("txn_id", "charge_id", "cart_id", "total_ammount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "carts" SET "is_ordered" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["is_ordered", "t"], ["updated_at", "2019-04-12 14:28:10.566931"], ["id", 4]]
---
  def create

  	cart = Cart.find(params[:cart_id])

  	# product = cart_item.product_list
  	# cart = cart_item.product_list

    # customer = Stripe::Customer.create(
    #   email: params[:stripeEmail],
    #   source: params[:stripeToken]
    # )


    @charge = Stripe::Charge.create({
					  amount: cart.total*100,
					  currency: 'usd',
					  source: params[:stripeToken], # obtained with Stripe.js
					  description: "#{current_user.email} has purchased product  ",
					})
    	if @charge
        @order_history = OrderHistory.new(txn_id: @charge.balance_transaction, charge_id: @charge.id,cart_id: cart.id,total_ammount: cart.total)
      else
      	redirect_to :back
      end

    @order_history.save
    Cart.find(cart.id).update(is_ordered: true)