app/controllers/commerce_controller.rb

SELECT "product_lists".* FROM "product_lists"
---
  def products_list
    @products = ProductList.all

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 5]]
---
  def destroy
    @remove_product_from_cart = CartItem.find(params[:id])
    @remove_product_from_cart.destroy

SELECT "order_histories".* FROM "order_histories"
---
  def orders
    @order = OrderHistory.all

SELECT "product_lists".* FROM "product_lists"
---
  def product_detail
    @products = ProductList.all

SELECT  "product_lists".* FROM "product_lists" WHERE "product_lists"."id" = $1 LIMIT 1  [["id", 36]]
---
  def add_to_cart

    @product = ProductList.find(params[:id])