app/controllers/dashboards_controller.rb

SELECT "projects".* FROM "projects"
---
  def dashboard_4_1
        @projects = Project.all