app/views/commerce/cart.html.erb

            <div class="ibox-title">
                <span class="pull-right">(<strong><%= current_cart.cart_items.count %></strong>) items</span>
---
SELECT  "carts".* FROM "carts"  ORDER BY "carts"."id" DESC LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]